---
kind: property
id: P:Autodesk.Revit.DB.WallSweepInfo.WallSweepOrientation
source: html/2456c9bb-8bf7-282b-c5de-2a1e57cfe47d.htm
---
# Autodesk.Revit.DB.WallSweepInfo.WallSweepOrientation Property

Indicates how the profile of a horiztonal sweep is oriented with repect to the wall side face.

## Syntax (C#)
```csharp
public WallSweepOrientation WallSweepOrientation { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration